IDEA StatiCa Open Model
ConnectionData.Beams Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Connected beams
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<BeamData> Beams { get; set; }
Public Property Beams As List(Of BeamData)
	Get
	Set
public:
property List<BeamData^>^ Beams {
	List<BeamData^>^ get ();
	void set (List<BeamData^>^ value);
}
Property Value
Type: List<BeamData>
See Also
Reference
ConnectionData Class
IdeaRS.OpenModel.Connection Namespace